#include <stdint.h>
#include "init.h"
int main(void)
{
    gpio_init();
    int counter = 0;
    int was_changed = 0;
    while (1)
    {
        // Считываем значение с кнопки на пине B3
        if (READ_GPIO_B3 != 0)
        {
            if (was_changed == 0)
            {
                counter++;
                if (counter == 3)
                    counter = 0;
            }
            was_changed = 1;
        }
        else
        {
            was_changed = 0;
        }

        if (counter == 0)
        {
            // Считываем значение с кнопки на пине B4
            if (READ_GPIO_B4 != 0)
            {
                // Включаем свечение зеленого светодиода
                SET_GPIO_B0;
            }
            else
            {
                // Выключаем свечение зеленого светодиода
                RESET_GPIO_B0;
            }

            // Считываем значение с кнопки на пине B5
            if (READ_GPIO_B5 != 0)
            {
                // Включаем свечение синего светодиода
                SET_GPIO_B1;
            }
            else
            {
                // Выключаем свечение синего светодиода
                RESET_GPIO_B1;
            }

            // Считываем значение с кнопки на пине B6
            if (READ_GPIO_B6 != 0)
            {
                // Включаем свечение красного светодиода
                SET_GPIO_B2;
            }
            else
            {
                // Выключаем свечение красного светодиода
                RESET_GPIO_B2;
            }
        }
        else if (counter == 1)
        {
            // Считываем значение с кнопки на пине B4
            if (READ_GPIO_B4 != 0)
            {
                // Включаем свечение красного светодиода
                SET_GPIO_B2;
            }
            else
            {
                // Выключаем свечение красного светодиода
                RESET_GPIO_B2;
            }

            // Считываем значение с кнопки на пине B5
            if (READ_GPIO_B5 != 0)
            {
               // Включаем свечение зеленого светодиода
                SET_GPIO_B0;
            }
            else
            {
                // Выключаем свечение зеленого светодиода
                RESET_GPIO_B0;
            }

            // Считываем значение с кнопки на пине B6
            if (READ_GPIO_B6 != 0)
            {
                // Включаем свечение синего светодиода
                SET_GPIO_B1;
            }
            else
            {
                // Выключаем свечение синего светодиода
                RESET_GPIO_B1;
            }
        }
        else if (counter == 2)
        {
            // Считываем значение с кнопки на пине B4
            if (READ_GPIO_B4 != 0)
            {
               // Включаем свечение синего светодиода
                SET_GPIO_B1;
            }
            else
            {
                // Выключаем свечение синего светодиода
                RESET_GPIO_B1;
            }

            // Считываем значение с кнопки на пине B5
            if (READ_GPIO_B5 != 0)
            {
                // Включаем свечение красного светодиода
                SET_GPIO_B2;
            }
            else
            {
                // Выключаем свечение красного светодиода
                RESET_GPIO_B2;
            }

            // Считываем значение с кнопки на пине B6
            if (READ_GPIO_B6 != 0)
            {
                // Включаем свечение зеленого светодиода
                SET_GPIO_B0;
            }
            else
            {
                // Выключаем свечение зеленого светодиода
                RESET_GPIO_B0;
            }
        }
    }
}
