#include <stdint.h>
#include "init.h"
int main(void)
{
    gpio_init();
    int counter = 0;
    int was_changed = 0;
    while (1)
    {
        // Считываем значение с кнопки на пине B3
        if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x08UL)) != 0)
        {
            if (was_changed == 0)
            {
                counter++;
                if (counter == 3)
                    counter = 0;
            }
            was_changed = 1;
        }
        else
        {
            was_changed = 0;
        }

        if (counter == 0)
        {
            // Считываем значение с кнопки на пине B4
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x10UL)) != 0)
            {
                // Включаем свечение зеленого светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x01UL;
            }
            else
            {
                // Выключаем свечение зеленого светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x010000UL;
            }

            // Считываем значение с кнопки на пине B5
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x20UL)) != 0)
            {
                // Включаем свечение синего светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x02UL;
            }
            else
            {
                // Выключаем свечение синего светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x020000UL;
            }

            // Считываем значение с кнопки на пине B6
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x40UL)) != 0)
            {
                // Включаем свечение красного светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x04UL;
            }
            else
            {
                // Выключаем свечение красного светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x040000UL;
            }
        }
        else if (counter == 1)
        {
            // Считываем значение с кнопки на пине B4
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x10UL)) != 0)
            {
                // Включаем свечение красного светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x04UL;
            }
            else
            {
                // Выключаем свечение красного светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x040000UL;
            }

            // Считываем значение с кнопки на пине B5
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x20UL)) != 0)
            {
                // Включаем свечение зеленого светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x01UL;
            }
            else
            {
                // Выключаем свечение зеленого светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x010000UL;
            }

            // Считываем значение с кнопки на пине B6
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x40UL)) != 0)
            {
                // Включаем свечение синего светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x02UL;
            }
            else
            {
                
                // Выключаем свечение синего светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x020000UL;
            }
        }
        else if (counter == 2)
        {
            // Считываем значение с кнопки на пине B4
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x10UL)) != 0)
            {
                // Включаем свечение синего светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x02UL;
            }
            else
            {
                // Выключаем свечение синего светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x020000UL;
            }

            // Считываем значение с кнопки на пине B5
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x20UL)) != 0)
            {
                // Включаем свечение красного светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x04UL;
            }
            else
            {
                // Выключаем свечение красного светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x040000UL;
            }

            // Считываем значение с кнопки на пине B6
            if ((*(uint32_t *)(0x40020400UL + 0x10UL) & (0x40UL)) != 0)
            {
                // Включаем свечение зеленого светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x01UL;
            }
            else
            {
                // Выключаем свечение зеленого светодиода
                *(uint32_t *)(0x40020400UL + 0x18UL) = 0x010000UL;
            }
        }
    }
}
