#include <stdint.h>

// Специальная функция задержки. 
// Атрибут noinline строго запрещает компилятору удалять или встраивать этот цикл.
__attribute__((noinline)) void delay(volatile uint32_t count) {
    while (count--) {
        __asm__ volatile ("nop");
    }
}

int main(void) {
    // 1. Включение тактирования ПОРТА С (ставим бит 2 в RCC_AHB1ENR)
    *(uint32_t*)(0x40023800UL + 0x30UL) |= (0x01UL << 2);

    // 2. Настройка 13-го пина GPIOC в режим вывода (Output)
    *(uint32_t*)(0x40020800UL + 0x00UL) &= ~(0x03UL << 26); // Очистка
    *(uint32_t*)(0x40020800UL + 0x00UL) |= (0x01UL << 26);  // Режим Output

    // 3. Настройка типа вывода 13-го пина на Push-Pull
    *(uint32_t*)(0x40020800UL + 0x04UL) &= ~(0x01UL << 13);

    while(1) {
        // --- 4. ВКЛЮЧАЕМ светодиод (низкий уровень на PC13) ---
        *(uint32_t*)(0x40020800UL + 0x18UL) = (0x01UL << 29); 
        
        // Вызываем задержку (увеличили число шагов для Cortex-M4 на 84 МГц)
        delay(1000000);

        // --- 5. ВЫКЛЮЧАЕМ светодиод (высокий уровень на PC13) ---
        *(uint32_t*)(0x40020800UL + 0x18UL) = (0x01UL << 13); 

        // Точно такая же задержка в выключенном состоянии
        delay(1000000);
    }
    
    // Защитный цикл
    while(1); 
}
